// Получить от пользователя данные
// о нужной конфигурации автомобиля: марка, цвет, год выпуска, пробег.
// Год выпуска проверить на число и на соответствие диапазону 1960 и текущим годом.
// Пробег проверить на число и на то что число больше 0 и меньше 200000.
// Из полученных данных создать объект автомобиля с помощью функции.
// Функция принимаем в себя параметры автомобиля и возвращает объект автомобиля.
// Без переданных данных, возвращает объект вида
// {
//     brand: 'Audi',
//     appearance: {
//         color: 'white'
//     },
//     year: ${текущий год},
//     mileage: 0
// }, а с переданными - соответствующие поля заполняются нужными данными.

// Полученный объект автомобиля вывести в на страницу.
// 
